{
  "onlyNeed": {
    "light": "We only need",
    "bold": "One Nishchay"
  },
  "tagLine": "Nishchay is <span>Open structure php framework</span> which helps you achieve your aim of building something awesome.",
  "easyInstall": {
    "title": "Installation",
    "latestRelease": {
      "title": "Download",
      "download": "Download",
      "then": "then extract in your project directory and <a href='{link}'>create encryption key.</a>"
    },
    "composer": {
      "title": "Using composer",
      "step1": "Install <a href='{link}' target='blank'>composer</a>",
      "step2": "Execute <code>composer create-project nishchay/nishchay</code> in your project directory via console window."
    },
    "install": {
      "title": "Setup guide",
      "description": "Go to <a href='{link}'>learning center</a> and follow installation based on your operating system and how do you want to install."
    }
  },
  "feature": {
    "title": "Why nishchay",
    "list": {
      "openStructure": {
        "title": "Open Structure",
        "description": "Open structure allow you to create your own kind of application structure or you can use existing application structure.<br/>Everything including controller, model, event, views, template etc. follows structure we define.<br/>This way our application supports only things which are defined in structure definition."
      },
      "database": {
        "title": "Database",
        "description": "Entity class which maps to database table and build simple to complex query using entity query builder. Query builder which directly works with database table.<br/> In built caching for both entity and normal query builder. Apart from this entity also has events, PII encryption and more."
      },
      "session": {
        "title": "Session",
        "description": "7 kinds of sessions which includes read limit session which expires after it's read limit is reached. Other sessions are like till next request, flash, scope, context and more.<br/>Nishchay also allows session data to be stored in files, DB and cache and you can create your own storage."
      },
      "maintenanceModes": {
        "title": "Maintenance modes",
        "description": "Put application into maintenance mode by various ways. Such maintenance modes are like browser level which allows application to be go into maintenance for list of browsers, all browser versions, range of versions and more.<br/> Other maintenance modes are timed based or based on callback method. Nishchay also allows exception for list of routes, route belongs to scope or context so that it can be executed even in maintenance mode."
      },
      "webService": {
        "title": "Web service/REST API",
        "description": "Apart from REST FULL route Nishchay provides web service features like response filter based on request, token based service, service response format. In built OAuth token generation and validation for the services including scope for the service. <br/>Using allowed method type we can also create GET, POST, PUT or other service to provide various operation on same route.<br/>Using response type we can create JSON/XML response."
      },
      "consoleCommand": {
        "title": "Console command",
        "description": "Console command allow us to create route, controller, entity and form.<br/>Create entity from database table and form using entity class.<br/>It can also be use for creating empty, CRUD or we can create it from template.<br/> It can also be used to find routes, controller, events and handler info of an application.<br/>Use console command to run route which is useful for CRON jobs."
      }
    }
  },
  "learnMore": "Learn more",
  "join": {
    "title": "Join community",
    "tagLine": "Take up Nishchay & bring your ideas to reality.",
    "buttonText": "Sign up"
  },
  "accountType": {
    "contributor": {
      "title": "Contributor",
      "tagLine": "Contribute to any of the following to promote account to contributor.",
      "list": {
        "line-1": "Contribute to framework",
        "line-2": "Help us translating to multiple language or improve existing content",
        "line-3": "Donate an amount"
      }
    },
    "developer": {
      "title": "Developer",
      "tagLine": "You can create normal account which is called developer account by default.",
      "list": {
        "line-1": "Add note to any topic in learning center",
        "line-2": "Your reading progress will be saved and can be seen in your profile",
        "line-3": "Get suggestions in profile"
      }
    },
    "organization": {
      "title": "Organization",
      "tagLine": "In short time you will be able join as an organization.",
      "list": {
        "line-1": "Submit project to get listed in website",
        "line-2": "Track reading progress of your developer",
        "line-3": "Code review by experts"
      }
    }
  }
}
